**PANDAS**

In [2]:
import pandas as pd

1.Create

1.1 from csv

In [4]:
df= pd.read_csv('Mumbai_1990_2022_Santacruz.csv')

2.Read

In [6]:
df.head()

         time  tavg  tmin  tmax  prcp
0  01-01-1990  23.2  17.0   NaN   0.0
1  02-01-1990  22.2  16.5  29.9   0.0
2  03-01-1990  21.8  16.3  30.7   0.0
3  04-01-1990  25.4  17.9  31.8   0.0
4  05-01-1990  26.5  19.3  33.7   0.0

read bottom

In [7]:
df.tail(6)

             time  tavg  tmin  tmax  prcp
11888  20-07-2022  27.4  25.0  30.5  11.9
11889  21-07-2022  27.6  25.6  30.5  10.9
11890  22-07-2022  28.3  26.0  30.5   3.0
11891  23-07-2022  28.2  25.8  31.3   5.1
11892  24-07-2022  28.1  25.6  30.4   7.1
11893  25-07-2022  28.3  25.1  30.2   7.1

show col and datatype

In [8]:
df.columns

Index(['time', 'tavg', 'tmin', 'tmax', 'prcp'], dtype='object')

In [9]:
df.dtypes

time     object
tavg    float64
tmin    float64
tmax    float64
prcp    float64
dtype: object

summary

In [11]:
df.describe()

               tavg         tmin         tmax         prcp
count  11883.000000  9440.000000  9987.000000  7213.000000
mean      27.762509    22.618549    32.315040    10.942007
std        2.189138     3.803629     2.234577    29.808576
min       17.700000     8.500000    22.300000     0.000000
25%       26.600000    19.800000    30.900000     0.000000
50%       28.100000    23.700000    32.400000     0.000000
75%       29.300000    25.400000    33.900000     7.100000
max       33.700000    30.400000    41.300000   461.000000

In [16]:
df.tmax

0         NaN
1        29.9
2        30.7
3        31.8
4        33.7
         ...
11889    30.5
11890    30.5
11891    31.3
11892    30.4
11893    30.2
Name: tmax, Length: 11894, dtype: float64

In [18]:
df[['tmax','tmin']]

       tmax  tmin
0       NaN  17.0
1      29.9  16.5
2      30.7  16.3
3      31.8  17.9
4      33.7  19.3
...     ...   ...
11889  30.5  25.6
11890  30.5  26.0
11891  31.3  25.8
11892  30.4  25.6
11893  30.2  25.1

[11894 rows x 2 columns]